# 7.2 数据转换

本章到目前为止介绍的都是数据的重排。另一类重要操作则是过滤、清理以及其他的转换工作。

## 移除重复数据

DataFrame中出现重复行有多种原因。下面就是一个例子：

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]}
                   )

data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

DataFrame的duplicated方法返回一个布尔型Series，表示各行是否是重复行（前面出现过的行）：

In [3]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

还有一个与此相关的drop_duplicates方法，它会返回一个DataFrame，重复的数组会标为False：

In [4]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

这两个方法默认会判断全部列，你也可以指定部分列进行重复项判断。假设我们还有一列值，且只希望根据k1列过滤重复项：

In [5]:
data['v1'] = range(7)

data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [6]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

duplicated和drop_duplicates默认保留的是第一个出现的值组合。传入keep='last'则保留最后一个：

In [7]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [8]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## 利用函数或映射进行数据转换

对于许多数据集，你可能希望根据数组、Series或DataFrame列中的值来实现转换工作。我们来看看下面这组有关肉类的数据：

In [9]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]}
                   )

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

假设你想要添加一列表示该肉类食物来源的动物类型。我们先编写一个不同肉类到动物的映射：

In [10]:
meat_to_animal = {
  'bacon':       'pig',
  'pulled pork': 'pig',
  'pastrami':    'cow',
  'corned beef': 'cow',
  'honey ham':   'pig',
  'nova lox':    'salmon'
}

Series的map方法可以接受一个函数或含有映射关系的字典型对象，但是这里有一个小问题，即有些肉类的首字母大写了，而另一些则没有。因此，我们还需要使用Series的str.lower方法，将各个值转换为小写：

In [11]:
lowercased = data['food'].str.lower()

lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [12]:
data['animal'] = lowercased.map(meat_to_animal)

data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

我们也可以传入一个能够完成全部这些工作的函数：

In [13]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

使用map是一种实现元素级转换以及其他数据清理工作的便捷方式。

## 替换值

利用fillna方法填充缺失数据可以看做值替换的一种特殊情况。前面已经看到，map可用于修改对象的数据子集，而replace则提供了一种实现该功能的更简单、更灵活的方式。我们来看看下面这个Series：

In [14]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

-999这个值可能是一个表示缺失数据的标记值。要将其替换为pandas能够理解的NA值，我们可以利用replace来产生一个新的Series（除非传入inplace=True）：

In [15]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

如果你希望一次性替换多个值，可以传入一个由待替换值组成的列表以及一个替换值：：

In [16]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

要让每个值有不同的替换值，可以传递一个替换列表：

In [17]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

传入的参数也可以是字典：

In [18]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

> 笔记：data.replace方法与data.str.replace不同，后者做的是字符串的元素级替换。我们会在后面学习Series的字符串方法。

## 重命名轴索引

跟Series中的值一样，轴标签也可以通过函数或映射进行转换，从而得到一个新的不同标签的对象。轴还可以被就地修改，而无需新建一个数据结构。接下来看看下面这个简单的例子：

In [19]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four']
                   )

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

跟Series一样，轴索引也有一个map方法：

In [22]:
transform = lambda x: x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [23]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

你可以将其赋值给index，这样就可以对DataFrame进行就地修改：

In [24]:
data.index = data.index.map(transform)

data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

如果想要创建数据集的转换版（而不是修改原始数据），比较实用的方法是rename：

In [27]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [28]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

特别说明一下，rename可以结合字典型对象实现对部分轴标签的更新：

In [26]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'}
           )

data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

## 离散化和面元划分

为了便于分析，连续数据常常被离散化或拆分为“面元”（bin）。假设有一组人员数据，而你希望将它们划分为不同的年龄组：

In [29]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

接下来将这些数据划分为“18到25”、“26到35”、“35到60”以及“60以上”几个面元。要实现该功能，你需要使用pandas的cut函数：

In [31]:
bins = [18, 25, 35, 60, 100]

cats = pd.cut(ages, bins)

cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

pandas返回的是一个特殊的 `Categorical对象`。结果展示了pandas.cut划分的面元。你可以将其看做一组表示面元名称的字符串。它的底层含有一个表示不同分类名称的类型数组，以及一个codes属性中的年龄数据的标签：

In [32]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [33]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [34]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

pd.value_counts(cats)是pandas.cut结果的面元计数。

跟“区间”的数学符号一样，圆括号表示开端，而方括号则表示闭端（包括）。哪边是闭端可以通过right=False进行修改：

In [35]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

你可 以通过传递一个列表或数组到labels，设置自己的面元名称：

In [41]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

bins = [18, 25, 35, 60, 100]

group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']


cats_v2 = pd.cut(ages, bins, labels=group_names)

cats_v2

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [42]:
pd.value_counts(cats_v2)

Youth         5
YoungAdult    3
MiddleAged    3
Senior        1
dtype: int64

如果向cut传入的是面元的数量而不是确切的面元边界，则它会根据数据的最小值和最大值计算等长面元。下面这个例子中，我们将一些均匀分布的数据分成四组：

In [43]:
data = np.random.rand(20)

data

array([0.54661106, 0.21341118, 0.65048579, 0.34884671, 0.9600015 ,
       0.10419172, 0.73374222, 0.62416117, 0.82897023, 0.24581848,
       0.25113723, 0.96621713, 0.42638211, 0.74365619, 0.41152574,
       0.10811416, 0.3895286 , 0.0455443 , 0.31114258, 0.02729113])

In [45]:
res_v3 = pd.cut(data, 4, precision=2)

res_v3

[(0.5, 0.73], (0.026, 0.26], (0.5, 0.73], (0.26, 0.5], (0.73, 0.97], ..., (0.026, 0.26], (0.26, 0.5], (0.026, 0.26], (0.26, 0.5], (0.026, 0.26]]
Length: 20
Categories (4, interval[float64, right]): [(0.026, 0.26] < (0.26, 0.5] < (0.5, 0.73] < (0.73, 0.97]]

In [46]:
pd.value_counts(res_v3)

(0.026, 0.26]    7
(0.26, 0.5]      5
(0.73, 0.97]     5
(0.5, 0.73]      3
dtype: int64

选项precision=2，限定小数只有两位。

qcut是一个非常类似于cut的函数，它可以根据样本分位数对数据进行面元划分。根据数据的分布情况，cut可能无法使各个面元中含有相同数量的数据点。而qcut由于使用的是样本分位数，因此可以得到大小基本相等的面元：

In [47]:
data = np.random.randn(1000)  # Normally distributed

data

array([-1.10780132e+00, -1.84965723e-02, -8.51714256e-01,  3.02786669e-01,
        8.34704202e-01,  1.22747157e+00, -1.60465778e+00,  1.25436376e+00,
       -7.68407164e-01, -1.39019942e-01,  1.72546399e-01,  9.68792824e-01,
       -1.02136154e+00, -1.11638735e+00,  1.93257755e-01, -8.58587786e-01,
        1.13567150e+00,  5.45667879e-01,  9.10790043e-02, -1.33910985e+00,
       -1.27120220e-01,  4.71574570e-01,  7.88517195e-02,  2.03202875e+00,
        3.82826307e-01, -7.05548182e-01, -1.95197975e+00,  5.52617690e-01,
        1.34375651e+00,  1.67785442e-02, -2.24600928e-01, -6.15872946e-01,
        1.67037921e+00, -6.48359356e-03, -9.72379169e-02,  9.84265927e-01,
        2.76726982e+00, -7.39072712e-01, -9.73085135e-01,  8.88006510e-01,
        2.84805483e-01, -1.53314694e+00, -1.21367666e+00,  1.68075090e+00,
       -1.58652674e-01, -8.25579862e-01,  1.76249594e+00, -2.56894647e-01,
       -8.77476942e-01,  7.49414243e-02, -2.61678641e-02,  3.19212472e+00,
        1.17567781e+00, -1.34193724e+00,  7.05829357e-02,  2.85248642e-01,
       -1.14544296e+00, -4.24998708e-01, -1.81827857e-01,  8.58270290e-01,
        1.23567415e+00, -7.99648503e-01,  1.01806032e+00, -1.30720679e-01,
        7.10568852e-01,  1.47937034e+00,  1.09717376e-01, -5.40980315e-01,
        3.02687772e-01,  4.25178339e-01, -4.52302578e-01,  1.10041341e+00,
        5.15234549e-01, -2.07434888e+00,  2.45147118e+00, -1.24995697e+00,
       -5.41219116e-02,  1.00624091e+00, -8.20400624e-01, -1.57226011e+00,
       -1.99199089e-01, -2.41346412e-01,  2.61658480e+00,  1.86506400e-01,
       -4.76307134e-01, -1.07259757e+00,  3.06165415e-01, -3.48040270e-01,
       -7.02620949e-01,  1.63036544e+00,  2.11658551e+00, -1.06626754e-01,
       -1.07921033e+00, -1.13568504e+00,  1.96581513e+00,  1.24756602e+00,
        8.51570650e-01,  7.02404690e-01, -1.73197187e+00,  6.32643167e-01,
        9.64275735e-01, -1.32148282e+00,  4.91407187e-01,  3.61507591e-01,
        6.15674150e-01,  1.00413847e-01, -9.68567014e-01, -1.12652797e+00,
       -4.18395292e-01,  1.84156612e+00,  2.34368922e+00, -7.12605597e-01,
        5.78906378e-01, -8.98060768e-02,  1.78918223e+00, -1.97044771e-01,
       -8.68869234e-01, -4.71119821e-01,  1.35840193e-02, -8.25963055e-01,
        7.51401426e-01,  7.35171123e-01, -1.81422308e-01,  3.00065681e-01,
        1.39478189e-01,  3.69269703e-01, -4.24444531e-01,  2.10674001e-01,
       -5.41784426e-01,  1.75959333e+00,  1.36527743e+00, -1.03593802e+00,
        5.29876620e-01, -6.55499043e-01,  1.64420520e+00, -9.88563793e-01,
       -2.03084689e+00, -1.14941433e+00,  2.90885218e-01,  7.31258219e-01,
       -1.66083685e-01,  9.08620394e-01,  1.39067571e-01, -5.16115621e-01,
        2.07931433e+00,  1.15766681e-01,  7.52273849e-02, -9.95210194e-01,
       -1.45015833e-01,  7.16864775e-01, -9.62788515e-01,  4.37233153e-01,
        1.04087707e+00, -2.40522641e-01, -1.86052625e+00, -2.90773323e-01,
        4.11454742e-01, -3.60728120e-01,  8.74049648e-01,  1.30522067e+00,
        1.62839670e+00,  4.65255629e-01,  1.75983531e+00,  1.83522514e-01,
        1.03847363e+00,  1.32135217e+00,  1.08983671e-01, -9.90943148e-01,
       -9.08227201e-01,  2.62598273e+00, -2.18022256e+00,  1.02042203e+00,
        1.85663126e+00, -1.92646029e-01,  6.78861838e-01, -5.30388406e-01,
        5.03160552e-01, -1.12865854e+00,  1.63035581e+00,  9.32613464e-01,
       -6.22942284e-01,  2.21264314e+00,  6.66176291e-02,  1.10832543e+00,
        1.14007653e+00, -3.06897475e-01,  1.30465961e-01,  1.18896104e+00,
       -2.28277868e-01, -5.27156219e-01, -1.43563108e+00, -1.39570741e-01,
       -8.03047905e-02, -2.73090404e-01,  1.14752610e+00, -1.13216824e+00,
        1.16199793e-01,  1.42100254e+00, -1.38223881e+00,  1.35584524e-01,
        3.28704133e-01, -7.42921738e-01,  6.68209747e-01, -1.48684844e+00,
       -6.48253327e-01, -1.89071690e-01,  1.06339318e+00,  1.00938900e+00,
       -8.57082510e-01, -3.78350522e-01, -8.90914237e-01,  1.04864048e+00,
        1.04322306e+00,  2.02120467e-01,  1.67389352e+00, -6.20407358e-01,
        1.78519239e-01,  3.22012423e-01,  1.47730698e+00, -8.87169513e-02,
       -2.19245144e-01,  6.47197510e-01, -1.59083303e+00, -4.39769251e-01,
        3.11310680e-01, -1.32884733e+00,  2.13797769e+00, -1.37148496e+00,
       -1.74788927e-02, -5.11028414e-01, -1.17638119e+00,  7.81711586e-01,
        1.48436202e+00,  6.77396160e-01,  6.14869742e-01,  5.66324619e-02,
        1.58439900e-01, -1.15280924e+00,  1.18176176e+00,  6.39516999e-01,
       -5.12394181e-01,  7.47973356e-01,  1.51693242e+00, -1.29667246e-01,
        5.88507363e-01, -1.28957198e-01, -2.90509650e-01, -1.26516577e+00,
        2.64790406e-01,  7.22660554e-01,  3.30350753e-01, -4.99818386e-01,
       -7.61996528e-01, -2.38461318e-01, -6.43098046e-01,  1.48660755e+00,
       -1.64258903e+00, -1.14216163e+00,  6.98208294e-01,  5.01089648e-01,
       -5.08619025e-01,  8.90245350e-01,  2.14425559e-01,  1.14536681e-01,
       -5.96967043e-01,  9.43491341e-02, -1.31732936e+00,  1.09144936e+00,
        7.76739282e-01, -5.19768862e-02, -1.38371775e-01,  3.06615015e-01,
        1.11760028e+00, -1.95304848e+00,  6.98672957e-01, -1.57458798e+00,
       -5.75792365e-01, -5.73973116e-01,  2.22233672e-01,  1.00255448e+00,
       -1.29226035e+00, -4.74805033e-01,  1.00003715e+00, -4.58727024e-01,
       -5.13521854e-01, -2.01792009e-01, -5.23557398e-01, -1.47766439e+00,
        3.20295073e-01,  1.38695166e-01,  1.69531042e+00,  2.04802219e+00,
       -1.16199961e+00,  3.94576266e-02, -1.28216467e+00, -1.52136459e+00,
       -4.75247664e-01,  2.17455987e+00, -7.91191849e-01, -8.13382039e-01,
       -2.00461193e+00,  8.24500624e-01,  2.75727927e+00,  1.11809780e+00,
        3.68669258e-01, -1.92007870e+00, -3.18657520e-01,  1.46184729e-01,
       -4.49389718e-01, -3.98817272e-02, -9.59180365e-01,  1.59944113e+00,
       -1.09726479e-01,  1.14917396e+00, -8.15924349e-01,  2.39766567e-01,
       -2.94382479e-01,  5.84106881e-01, -4.39223986e-02, -6.49366863e-01,
        1.29701454e+00, -8.31843350e-02,  4.68310060e-01,  3.35055724e-01,
       -1.42805761e+00, -2.23314415e-01, -1.78426280e-01, -1.50765507e+00,
        5.19814994e-01, -1.03928400e+00,  1.60794616e-01, -1.13041042e+00,
       -1.16489426e+00, -7.00907022e-02, -7.13576903e-01, -5.66291708e-02,
       -5.22760686e-01, -1.02696255e-01,  1.23137730e-01,  1.01443698e-01,
       -6.09411742e-02,  4.57765832e-01,  4.14342976e-01, -8.90901646e-01,
       -1.96664471e-01, -5.51574279e-01, -4.27214985e-01,  1.27735693e-01,
       -1.01347450e+00,  7.18035502e-01,  1.22348482e+00,  8.62964533e-01,
        1.24394331e+00, -9.77568695e-01, -1.78922433e+00, -1.94639879e-01,
       -1.44717985e+00,  2.31632745e-01,  3.70817914e-01,  1.04549989e+00,
       -5.75820371e-01,  2.76879051e-01,  9.94968875e-01, -1.83258441e-01,
       -4.49488342e-01,  3.41098035e-01, -5.54653852e-01,  2.82095534e-01,
       -1.61087488e-01,  1.98006358e-01, -1.52761653e-01,  1.24699536e+00,
       -7.18622910e-01,  2.81681429e+00,  5.35909754e-01, -9.67894934e-01,
        5.13910678e-03, -7.65141925e-01,  9.73989880e-01, -7.03271430e-01,
        2.44682887e+00,  3.08954945e-02, -1.01910236e+00, -4.70765929e-02,
        3.38151684e-01, -1.14886800e+00,  1.12042713e+00, -1.63311008e-01,
        2.10109552e+00,  3.09216922e-01, -4.70482777e-01, -9.30887414e-02,
        1.13374281e+00, -1.50220126e+00,  1.59612468e+00, -9.77009638e-01,
        6.04182551e-01,  2.32593298e-01,  4.60984052e-01,  2.01945460e-01,
        2.56909896e+00,  9.20873993e-01,  9.88512197e-01,  1.95681200e+00,
       -5.28700687e-01,  9.90980200e-01,  1.21872482e+00, -8.80105236e-01,
        6.69803483e-01,  1.02195005e+00, -1.60660766e-01,  8.47300551e-01,
       -3.53080855e-01,  1.33095430e+00,  1.25874819e+00,  9.89322999e-02,
       -2.87921493e-01,  4.25431911e-01, -8.71773347e-01,  8.75978768e-01,
        1.01425533e+00, -3.70616846e-01,  8.48581598e-01,  1.00550664e+00,
        4.62751787e-01, -6.55472114e-01, -1.35962878e-01,  1.04848132e+00,
        6.71688318e-02, -5.10693455e-02,  1.47018895e+00,  5.87722527e-01,
       -1.62392471e+00, -2.43180552e-01,  8.03923481e-01,  1.11749630e+00,
       -1.35476822e+00, -7.23770403e-01,  7.97409963e-01, -4.58707555e-02,
        2.71993221e-01,  2.39640545e+00, -1.43671465e+00,  1.12935710e+00,
       -9.94898232e-01, -7.89307016e-02, -1.04550841e-01, -1.70879799e+00,
       -8.16943964e-01, -2.20192281e+00, -5.25246235e-01, -2.10641559e-01,
       -6.55679151e-01, -1.75821854e-02,  9.15715294e-01,  8.10739957e-01,
       -1.24648073e+00, -7.80881262e-02, -5.02425820e-01,  5.11027714e-01,
       -4.21709655e-01,  2.34075718e-01, -1.11764882e+00,  3.38226701e-01,
        1.26046410e+00, -6.46886291e-01, -1.34834759e+00, -1.86491807e-01,
       -8.13410874e-01,  4.36726720e-01,  8.29839183e-01, -9.22957093e-01,
       -1.29112812e-01, -1.23230702e+00,  9.34483868e-01, -4.34904579e-01,
        2.14559142e-01, -1.74339711e-01, -2.30343612e-01, -4.80687157e-01,
       -2.28730208e+00,  8.49184571e-01,  1.77781664e-01,  1.25341333e+00,
       -1.29215219e+00, -1.44953371e-01,  6.44275074e-01, -2.14972636e-01,
        1.15190193e+00, -7.16710308e-01, -1.13329913e+00, -7.35010014e-01,
       -9.79647942e-02,  6.87948116e-01, -5.36207767e-01,  4.67597395e-01,
       -3.51563700e-01,  3.05396521e-01,  1.90822705e-01, -3.98913132e-01,
        1.57650020e+00, -1.03466073e+00,  1.28337929e-01, -1.34795965e+00,
        3.69345274e-01,  2.42587475e-01,  1.11299956e+00, -1.20520682e+00,
       -4.41505531e-01, -4.03762358e-01,  7.14736833e-03, -4.82780317e-01,
        1.30073304e+00, -5.70170266e-01, -1.25174461e+00,  2.12946637e+00,
        3.41144484e-01, -3.88285730e-01, -1.64073521e-01,  6.65594524e-01,
        9.03716694e-01, -8.05395878e-02,  9.95736995e-01,  6.21276057e-01,
        1.83868049e-01,  6.34984582e-01,  5.37393254e-02, -1.30587695e+00,
       -1.02802396e-01,  9.52804502e-01,  6.06921720e-01,  2.24160982e+00,
       -1.36507936e-02,  2.06445484e+00, -6.92560323e-01, -2.59932379e+00,
        4.25157202e-01, -1.43185563e+00, -4.99915860e-01, -1.06763897e+00,
        7.73724767e-01,  1.26876410e+00,  1.02823345e+00, -4.42949626e-01,
        1.47207877e+00, -1.46148338e+00,  2.42858161e-01,  1.76331319e-01,
       -1.10196246e+00, -8.15464773e-01,  1.26281616e+00,  5.07327486e-01,
        1.94530879e+00,  2.97398213e+00,  3.54432661e-01, -3.75147158e-02,
        9.58782456e-01, -1.38013380e+00,  6.75657401e-01,  9.19208497e-01,
        2.75968934e-01,  3.69903753e-01,  1.52691875e-01,  4.68433040e-02,
       -1.16948411e+00, -7.81841985e-02, -1.59981407e-01, -3.66469696e-01,
       -1.27460703e+00,  4.72240160e-01,  2.45036379e-01,  4.90447146e-01,
       -2.53608666e-01,  7.40310343e-01, -7.97657278e-02, -4.26878190e-01,
        7.44449088e-01, -1.81453141e-01, -4.81683326e-01,  5.67245159e-01,
        1.02533210e+00, -5.43134348e-01, -1.68033008e+00,  5.07601981e-01,
       -3.18944335e-01, -7.59893613e-01, -1.08518143e+00, -6.83434312e-01,
        1.16446561e+00, -1.11527147e-01, -8.87708730e-01,  1.56409882e+00,
        1.17424421e-01, -6.87433718e-01,  5.11053893e-01, -1.55010658e+00,
        2.84237292e-01, -7.91786190e-01,  5.95059189e-01,  5.53895928e-01,
       -1.93304898e+00,  4.33572113e-01, -1.18511712e+00, -5.40981153e-01,
       -4.23890319e-01, -1.14546682e+00, -9.86665271e-01,  6.44766754e-01,
        1.47362445e+00, -1.89817627e+00, -6.67048872e-01,  2.28668619e-01,
        1.28978023e-01,  1.52433117e-01,  9.03327941e-01,  1.43819105e+00,
        6.55506050e-01, -1.45718615e-01, -4.47277936e-01,  1.05903457e-01,
       -1.02308932e+00,  9.51133318e-01, -3.37982522e-01,  9.89654708e-01,
       -1.83588756e-01, -6.95828605e-02, -7.25382723e-01, -6.91460952e-01,
        1.28494151e+00,  1.20272015e+00, -7.82161284e-01, -9.01302785e-01,
        4.36518572e-01,  1.11643824e+00, -1.82148721e-01,  2.82321797e-01,
       -2.06240263e-01, -1.09013581e-01, -8.62320221e-01, -3.41746652e-02,
       -1.07120087e+00,  3.20376963e-01,  2.79555304e+00, -4.83953481e-01,
        1.10856946e+00, -1.22298726e+00, -6.04157116e-01,  2.86639504e-01,
       -6.78215063e-01,  1.79542482e-01,  6.46900214e-01,  9.09263524e-01,
        1.76303771e-01,  2.88597800e-01, -6.67452422e-02,  9.65154843e-01,
       -2.41429633e+00,  1.50535654e-01,  8.00795721e-01,  7.76200106e-02,
       -9.28986382e-01,  1.94028747e-01, -3.29335891e-01, -7.07283250e-01,
       -5.73280128e-01, -9.86286573e-01,  1.01521841e+00, -1.42821291e+00,
       -8.77173607e-01,  8.94119999e-01,  7.59892403e-01,  1.38709507e+00,
        7.61171954e-01, -2.26467904e-01, -1.49918936e+00,  8.27994202e-01,
       -3.07770503e-02, -8.32393927e-01, -6.96455418e-01, -5.57643351e-01,
        1.04386420e-01, -2.42740988e+00,  2.73011312e-01, -6.77002455e-01,
        1.69887768e-01, -7.00023523e-01, -4.45027534e-01, -6.71495706e-01,
       -8.32720559e-02,  1.37396264e+00, -1.70719047e+00,  8.85423982e-01,
       -7.70507651e-01, -1.23089141e+00,  4.91378008e-01,  2.56006571e-01,
       -7.79006725e-01, -1.89692955e+00, -1.17623380e+00,  2.05155023e-01,
        2.63683052e+00,  1.51706003e+00, -5.43049481e-01, -1.10959461e+00,
       -5.26123657e-02, -2.40332043e+00, -3.74577150e-01,  2.86585236e-01,
        9.56162349e-01, -2.76014336e+00, -2.69562504e-01,  4.54457846e-01,
       -5.98805610e-01,  7.66143440e-01,  1.54601679e+00, -1.60738705e+00,
        9.10475554e-01,  1.09509140e-01,  7.58074982e-01,  1.03631333e+00,
        1.11519511e+00,  1.69966958e+00, -6.23026980e-01,  2.04005217e+00,
        1.73822955e+00, -5.10406362e-01,  1.35381527e-01,  4.01427399e-01,
       -1.32314362e+00, -5.42138483e-01, -3.63789859e-01,  1.66241837e+00,
       -6.27392701e-01, -8.42440801e-01, -2.86445446e-01, -1.14015729e+00,
       -1.45625370e+00, -1.41535879e+00, -9.54096958e-01,  1.67812741e+00,
       -3.95244355e-01, -1.04125793e+00, -3.44259498e-01,  1.09576372e+00,
        8.62724850e-03, -6.62473270e-01, -5.15464430e-01, -6.92266700e-01,
        2.40884171e-01,  3.00054104e-01, -1.55020497e+00,  3.77831976e-01,
       -3.08070429e-01, -1.75950442e-01, -1.08556428e-01, -1.71895284e+00,
       -1.60720397e+00,  9.52596861e-01,  1.71789053e+00, -1.02179071e-01,
       -1.09497021e+00, -9.00356078e-01,  6.02399993e-01,  1.47840045e+00,
       -3.30917789e-01,  4.31979943e-02,  1.06349368e+00,  2.35477583e+00,
       -1.07963039e+00, -7.00001490e-01, -1.34314200e+00, -1.04015022e+00,
        3.22994185e-01, -1.17431329e-01,  1.50362871e+00, -1.00263353e-01,
        2.58078669e+00, -2.49391603e-01,  1.40235030e-01, -1.58950330e-01,
       -2.60317686e-01,  9.33681075e-01,  5.09111813e-01,  2.36051502e+00,
       -1.05970355e+00, -1.02805932e+00, -1.24141829e+00,  5.73126818e-01,
        9.73036392e-01, -8.73370691e-01, -6.59707180e-01,  2.01236005e-01,
        1.78102698e-01, -4.46452926e-01,  5.34954172e-01,  8.46296782e-01,
       -7.85541428e-01, -7.94548791e-01, -9.14144294e-01,  2.58820907e-01,
        4.39014999e-01,  5.75765554e-01, -1.14941586e-01,  1.01543282e+00,
       -1.59191132e+00,  1.86576914e-01,  7.25993222e-01,  4.80697863e-01,
        9.11081086e-01, -1.75336081e+00, -3.35471425e-01,  1.40731456e+00,
        4.03583014e-01,  9.62248894e-02,  1.02608252e+00, -1.77127772e-01,
        1.91930447e+00,  4.62417785e-01, -5.82119790e-01, -4.39297195e-01,
        9.97189417e-02,  1.86198667e+00, -6.58174848e-01,  3.57911258e-01,
        1.62699223e+00,  1.10510166e+00,  6.75515339e-01, -4.30549668e-01,
       -6.11385261e-01,  1.14255814e+00, -9.17578791e-01, -1.03009453e+00,
       -1.28548610e-02,  6.26538289e-02,  4.81282547e-01,  1.81751819e-01,
       -1.08337354e+00,  1.06704030e+00, -5.55323665e-01,  6.06387920e-02,
        4.66452454e-01, -5.87288103e-01, -2.39296392e-01, -3.34400621e-01,
       -5.93976278e-01, -1.27225501e+00, -1.05503847e+00,  1.30372107e+00,
        1.25456068e+00,  7.89197575e-01, -5.89890558e-01,  5.92879876e-01,
       -9.25463657e-01,  5.06084114e-01,  9.63950287e-01, -1.91874301e+00,
        3.21282835e+00, -7.03338705e-01,  4.13390993e-01,  1.27275628e+00,
       -9.80376790e-01, -1.11833802e+00, -3.48399302e-01,  4.97652936e-01,
        6.50927955e-01,  1.11016800e+00,  1.73408778e+00, -1.08566018e+00,
       -1.66031951e+00,  1.74351275e+00, -1.26514286e+00, -6.93099767e-01,
       -1.13274048e+00, -4.37461417e-01,  8.39555695e-01,  3.21179850e-01,
        8.61023203e-01,  1.20656535e+00, -5.94847188e-01,  1.72548822e+00,
        1.71137141e+00, -2.05461981e+00, -1.53198968e+00, -6.69890009e-01,
        1.17335909e+00,  3.70214018e-01,  7.88574136e-01, -1.67998366e+00,
        6.94875621e-01,  5.43283642e-01,  2.67880672e-01, -6.01653983e-01,
       -1.03887223e+00,  3.81697899e-01, -3.31386134e+00, -3.30770082e-01,
        5.17700311e-02, -1.05101512e+00, -2.45910457e-01, -3.61143744e-01,
        2.25039705e-01, -5.70653491e-01,  2.46158759e+00,  2.14615085e-01,
       -2.17449238e-01,  3.95067595e-01,  8.70615409e-01, -3.54561589e-01,
        4.34405268e-01,  8.60134592e-02,  1.32634132e-01, -8.58320054e-01,
        6.37412014e-01, -5.01970540e-01,  1.17903102e+00,  4.67040192e-01,
        1.71977443e-01, -1.57627671e+00, -3.36701898e-01, -5.09742884e-02,
       -9.39567155e-01, -1.06265045e-01, -7.14388367e-01, -1.92694208e-01,
        1.21811286e+00, -1.51843277e-01, -2.04560314e+00, -1.00907795e+00,
        1.39483151e+00,  1.55740255e+00, -1.07523775e+00,  5.34064771e-01,
       -1.93112553e+00,  2.99492537e-01,  4.26685632e-01,  6.86491729e-01,
        8.44802810e-01, -1.86382697e-01,  1.32001552e-01, -1.00215634e-01,
        1.31157714e+00,  1.43014811e+00, -1.90897433e+00, -1.38129116e+00,
        1.03304372e+00, -8.13420919e-01, -1.20158810e-01,  1.31889254e+00,
       -1.46787638e-01, -1.76881797e-01,  3.04549905e-01, -6.53111216e-01,
       -1.34008356e-01, -6.15126815e-01,  1.00063129e+00,  8.22439356e-02,
        6.32273554e-01,  1.04378001e+00, -9.27391657e-01,  1.73122830e-01,
       -2.90041639e-01,  2.98770008e-01, -4.33525181e-01,  7.63064478e-01,
        8.73197562e-01, -1.47352273e+00,  2.21904014e+00, -9.38999950e-01,
        1.05797814e-01, -1.77263098e+00,  5.34149929e-01,  1.64622287e+00,
        1.35712344e+00, -4.00487998e-02, -5.14589977e-01, -2.47703293e-02,
        8.27913711e-01, -5.50821383e-01, -1.07684166e+00, -2.76544164e-04,
       -6.72691442e-02, -7.45853643e-01,  5.76723967e-01,  1.57838560e+00,
       -1.13976199e+00, -1.26525772e-01, -8.40632863e-01, -1.89802590e+00,
       -6.40897735e-02, -2.50371265e-01, -4.75773618e-01, -1.90146941e+00,
        7.68426637e-01,  1.56233731e+00, -1.51420120e+00,  1.01071616e+00,
       -1.00519661e+00, -6.18132599e-01,  9.85424449e-01,  5.12621244e-01])

In [48]:
cats = pd.qcut(data, 4)  # Cut into quartiles

cats

[(-3.315, -0.656], (-0.656, -0.0133], (-3.315, -0.656], (-0.0133, 0.719], (0.719, 3.213], ..., (0.719, 3.213], (-3.315, -0.656], (-0.656, -0.0133], (0.719, 3.213], (-0.0133, 0.719]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.315, -0.656] < (-0.656, -0.0133] < (-0.0133, 0.719] < (0.719, 3.213]]

In [49]:
pd.value_counts(cats)

(-3.315, -0.656]     250
(-0.656, -0.0133]    250
(-0.0133, 0.719]     250
(0.719, 3.213]       250
dtype: int64

与cut类似，你也可以传递自定义的分位数（0到1之间的数值，包含端点）：

In [55]:
res_a = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

res_a

[(-1.176, -0.0133], (-1.176, -0.0133], (-1.176, -0.0133], (-0.0133, 1.274], (-0.0133, 1.274], ..., (-0.0133, 1.274], (-1.176, -0.0133], (-1.176, -0.0133], (-0.0133, 1.274], (-0.0133, 1.274]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.315, -1.176] < (-1.176, -0.0133] < (-0.0133, 1.274] < (1.274, 3.213]]

In [56]:
pd.value_counts(res_a)

(-1.176, -0.0133]    400
(-0.0133, 1.274]     400
(-3.315, -1.176]     100
(1.274, 3.213]       100
dtype: int64

本章稍后在讲解聚合和分组运算时会再次用到cut和qcut，因为这两个离散化函数对分位和分组分析非常重要。

## 检测和过滤异常值

过滤或变换异常值（outlier）在很大程度上就是运用数组运算。来看一个含有正态分布数据的DataFrame：

In [59]:
data = pd.DataFrame(np.random.randn(1000, 5))

data

            0         1         2         3         4
0   -0.628470  0.852790 -1.391426  0.349387  1.220137
1    0.058644  0.310716 -0.164380  0.024320  1.179610
2    1.254495  0.402902 -2.289132  1.794590 -0.105957
3   -0.146018  0.127235 -2.283615 -1.063468 -0.616641
4   -1.006175 -0.791468  0.252518  0.665419 -0.504912
..        ...       ...       ...       ...       ...
995 -0.720880 -0.108241 -0.035614  0.207703 -0.254406
996  1.432456 -0.506653 -1.513577 -1.748046 -0.107797
997  2.028627 -2.256784 -0.139630  0.012115  0.191477
998  0.234811 -0.173545  0.143070  0.489465 -0.162274
999 -1.000269 -0.038354  0.452454 -1.047262  1.960427

[1000 rows x 5 columns]

In [58]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.023053    -0.017792     0.019038    -0.013172
std       0.961715     0.990408     1.042301     1.023584
min      -2.840085    -2.971167    -3.704109    -2.929153
25%      -0.706753    -0.683379    -0.686312    -0.698741
50%       0.001285    -0.048737    -0.007689     0.000962
75%       0.619917     0.655426     0.753050     0.699141
max       2.936533     2.938289     3.710361     4.072049

假设你想要找出某列中绝对值大小超过3的值：

In [61]:
col = data[2]

col[np.abs(col) > 3]

406    3.064622
563   -3.006721
Name: 2, dtype: float64

要选出全部含有“超过3或－3的值”的行，你可以在布尔型DataFrame中使用any方法：

In [62]:
data[(np.abs(data) > 3).any(1)]

/tmp/ipykernel_18158/2969116195.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.any and Series.any will be keyword-only.
  data[(np.abs(data) > 3).any(1)]

            0         1         2         3         4
79  -1.144499  0.219758  0.579791 -3.288305  0.775134
122  0.396242  3.219888 -1.771242  0.741403 -0.980629
130  1.013701  0.351426  0.754790  3.217495 -1.131902
406 -0.775349  1.332316  3.064622 -0.098900  1.107835
511  0.093836  0.191390 -1.139619  0.760228  3.115306
558  0.824484  0.415785  1.488446 -3.740257 -0.283510
563  1.849226  0.233756 -3.006721 -0.440746  0.410375
584 -1.575498  0.651002  1.233014  3.088325  0.616894
918 -1.931807  0.715558 -0.892657  0.523993  3.064280

根据这些条件，就可以对值进行设置。下面的代码可以将值限制在区间－3到3以内：

In [79]:
data[np.abs(data) > 3] = np.sign(data) * 3

a = data[data > 1]

a

            0   1   2        3         4
0         NaN NaN NaN      NaN  1.220137
1         NaN NaN NaN      NaN  1.179610
2    1.254495 NaN NaN  1.79459       NaN
3         NaN NaN NaN      NaN       NaN
4         NaN NaN NaN      NaN       NaN
..        ...  ..  ..      ...       ...
995       NaN NaN NaN      NaN       NaN
996  1.432456 NaN NaN      NaN       NaN
997  2.028627 NaN NaN      NaN       NaN
998       NaN NaN NaN      NaN       NaN
999       NaN NaN NaN      NaN  1.960427

[1000 rows x 5 columns]

In [64]:
data.describe()

                 0            1            2            3            4
count  1000.000000  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.025961     0.014795     0.006197     0.052174     0.049874
std       0.971061     0.962089     0.998731     1.012816     0.980095
min      -2.956450    -2.836477    -3.000000    -3.000000    -2.999570
25%      -0.609803    -0.631368    -0.673561    -0.667661    -0.599227
50%       0.017840     0.033052    -0.002411     0.054808     0.019438
75%       0.665794     0.644878     0.669578     0.766049     0.694287
max       2.990743     3.000000     3.000000     3.000000     3.000000

根据数据的值是正还是负，np.sign(data)可以生成1和-1：

In [65]:
np.sign(data).head()

     0    1    2    3    4
0 -1.0  1.0 -1.0  1.0  1.0
1  1.0  1.0 -1.0  1.0  1.0
2  1.0  1.0 -1.0  1.0 -1.0
3 -1.0  1.0 -1.0 -1.0 -1.0
4 -1.0 -1.0  1.0  1.0 -1.0

## 排列和随机采样

利用`numpy.random.permutation`函数可以轻松实现对Series或DataFrame的列的排列工作（permuting，随机重排序）。通过需要排列的轴的长度调用permutation，可产生一个表示新顺序的整数数组：

In [80]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [82]:
sampler = np.random.permutation(5)

sampler

array([3, 1, 2, 4, 0])

然后就可以在基于iloc的索引操作或take函数中使用该数组了：

In [83]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [84]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11
4  16  17  18  19
0   0   1   2   3

如果不想用替换的方式选取随机子集，可以在Series和DataFrame上使用sample方法：

In [90]:
df.sample(n=5)

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7

要通过替换的方式产生样本（允许重复选择），可以传递replace=True到sample：

In [92]:
choices = pd.Series([5, 7, -1, 6, 4])

choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [94]:
draws = choices.sample(n=10, replace=True)

draws

2   -1
2   -1
2   -1
4    4
0    5
0    5
4    4
2   -1
2   -1
1    7
dtype: int64

## 计算指标/哑变量

另一种常用于统计建模或机器学习的转换方式是：将分类变量（categorical variable）转换为“哑变量”或“指标矩阵”。

如果DataFrame的某一列中含有k个不同的值，则可以派生出一个k列矩阵或DataFrame（其值全为1和0）。pandas有一个get_dummies函数可以实现该功能（其实自己动手做一个也不难）。使用之前的一个DataFrame例子：

In [141]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

有时候，你可能想给指标DataFrame的列加上一个前缀，以便能够跟其他数据进行合并。get_dummies的prefix参数可以实现该功能：

In [139]:
df_key = df['key']

df_key

0    b
1    b
2    a
3    c
4    a
5    b
Name: key, dtype: object

In [140]:
# 原来的 a, b, c [a, b, c] 行中所处的位置信息
dummies = pd.get_dummies(df_key, prefix='key')

dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [101]:
df[['data1']]

   data1
0      0
1      1
2      2
3      3
4      4
5      5

In [100]:
df_with_dummy = df[['data1']].join(dummies)

df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0